3. Save and Load data from csv

In [2]:
import pandas as pd
import numpy as np

In [6]:
data = {
     "Name": ["Tushar","vaibhav","deepika","Abdullah"],
     "roll_no": [1,2,3,4],
     "Age": [20,20,19,21],
     "marks": [80,85,73,93]
 }

df = pd.DataFrame(data)
print(df)

       Name  roll_no  Age  marks
0    Tushar        1   20     80
1   vaibhav        2   20     85
2   deepika        3   19     73
3  Abdullah        4   21     93

In [7]:
df.to_csv('test_data.csv',index=False) #save file - export dataframe

In [8]:
load_df = pd.read_csv("test_data.csv") #load file - import dataframe
load_df

       Name  roll_no  Age  marks
0    Tushar        1   20     80
1   vaibhav        2   20     85
2   deepika        3   19     73
3  Abdullah        4   21     93

In [14]:
load_df.head(2) # first 2 rows

      Name  roll_no  Age  marks
0   Tushar        1   20     80
1  vaibhav        2   20     85

In [15]:
load_df.tail(2) #last 2 rows

       Name  roll_no  Age  marks
2   deepika        3   19     73
3  Abdullah        4   21     93

In [ ]:
load_df.info() #  structure, null, datatype

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     4 non-null      object
 1   roll_no  4 non-null      int64
 2   Age      4 non-null      int64
 3   marks    4 non-null      int64
dtypes: int64(3), object(1)
memory usage: 260.0+ bytes

In [ ]:
df1 = pd.read_csv("test_data.csv",usecols=["Name","marks"]) # to read selected columns
df1

       Name  marks
0    Tushar     80
1   vaibhav     85
2   deepika     73
3  Abdullah     93

In [30]:
# df2 = pd.read_csv("test_data.csv",header=None)
df2 = pd.read_csv("test_data.csv", header=None, names=["A","B","C"])
df2

                A    B      C
Name      roll_no  Age  marks
Tushar          1   20     80
vaibhav         2   20     85
deepika         3   19     73
Abdullah        4   21     93

In [ ]:
df.to_csv("output.csv",index=False) #without index 
#df.to_csv("output.csv",sep = ";") custom seprator

In [ ]:
df.to_csv("selected_column.csv",columns=["Name","marks"]) # to save selected column

In [35]:
# Real-life example
data1 = {
    "name": ["Arman","Akansha","pritish"],
    "Marks": [75,88,65],
    "city": ["delhi","delhi","up"]
}

df3 = pd.DataFrame(data1)
# Save
df3.to_csv("students.csv",index=False)

#Load again
new_df = pd.read_csv("students.csv",usecols=["name","Marks"])
print(new_df)

      name  Marks
0    Arman     75
1  Akansha     88
2  pritish     65

In [ ]:
# Important parameters 

# For reading:

# sep

# usecols

# header

# names

# nrows

# For saving:

# index

# sep

# columns